#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "b7308d98182571da8b70656e0c2673d9" -> "01f0dde8ab471110c769f37b7cfb2150"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "4e6fac809ea28493c2622723d7bff66d" -> "ea686a315e9102a4c82731a2405e388d"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "08c50f477a806a24267c853bf78805d5" -> "1cdaf2465615bbaa77e2783643fda2ed"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "e8cedad381af154b1a5c74d1d0112243" -> "366d6ba4e4512e8811bb9dcfeed12e45"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "3bbd55db1e6ba4bd16f4b9aa15701149" -> "5c29278bbe13846b41c08d68ea6f1516"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "aa3db18417da16031b3d286d082fd00c" -> "91df7dfac74eb77ffed0182f29399448"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "aa361f11cb99efc7bbfe71eb07b94d1d" -> "207ec09c8505cde13cf350f4cdd2b094"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "8a427770bb13c569e9263cb4cfb561c0" -> "921e0324d9076ad369fa19e483bb5de6"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "c746c8ba371bcd284817e8c555e23e2f" -> "96c5ce60de937c79a71ce32465b738ea"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "2111723bf19c0a9b0a2af829ca5b46dd" -> "4413ed21d2504fb745c639a2b2cb04e7"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "ec14616d9f7c8878474b7a6f325c4fce" -> "7550849ba75fbf7e59ec0dc484f7334a"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "f689e89f9ebc884e7bc207da284cf14b" -> "5410eefaf7763aa4e11027bbac128fd9"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "34d91ef0e618820b7e811d01239a611f" -> "d53a3a4b0ddb33f6af612a65aee1e657"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "3cfbd69a828fb2d2354eed51af28ed28" -> "e16044e9a01723117c8bc5cd803af05f"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "6e878663eecc94758e718e080583a199" -> "6c82912ff415313dacb7adbbbf0da430"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "005857587cfbea061e206d830013dd5b" -> "0036c384f36b727466609de06828f0db"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "ff8d0d8361db5be960cbc7bb79789039" -> "b0ab1cf1a49a3c475164d52577be1d0a"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "fabe9ba8dcc44229ace9325978bffef9" -> "21552d2ef7b290159bddbfa409344d9b"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "187c4f386d6ef74c49b9da65c49efc63" -> "085fdf122357a3c735641c385af8d0b9"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "8f9f3e0fdf603b6cc3ce7b0ef1bf5c47" -> "7c5243ef44de13680665ce19e8c8a531"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "a5f82f1dd1c4b3db5985c630281e3c8c" -> "a749e5f01ed657c6732f61f29ba93ff8"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "8f23c53661bcaba33bab3909098a98db" -> "2b3e8310ee084cfa64581daa32ab8a7c"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "e2f1b0e8aa95cb1a7f3d373255f2e3d7" -> "e4bda9aa3e7741a5577dc90fef286c19"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "c4f76b068684a5776e759452fa9b9399" -> "5a7ee7f1d533dac44d09ff9e272e635d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "f22c2b8680800cf000b722a3dcb9aeaa" -> "ad98cffcc13708bedd7e2aa2cafb693c"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "bb3d3d96bf8631dcaf2388f642c4f997" -> "c479232643b95a64217a0f5344f61b0d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "dbb5b2b82e0aa6a2e02c30bf846fcc59" -> "136c95313371c32382ec7c8e2ed6759f"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "562e3d8094cd36caa0524d193ccdef1b" -> "7434405dc6f634a851b88b10ff610569"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "99c41939f42577092e6fa2e79c4b7b14" -> "3ec2b5908e4193502ba661bb5a18050d"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "eb55c653a29e22d8b10885eb5b4e41fd" -> "59230e5b31ffe6262a6b496467a172b5"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "e2d0cab8ba0fb9daa70bb282db5cbd9c" -> "8bbdd192a1e9270b4e23cb9d37121932"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "941f448a1a07348d61d488b47b8a9430" -> "9c4df49abeb5a3693c6c2b3e4afcb05f"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "34582faa67fbec523d387e1db0533be3" -> "f2e3f82d399c49a67a8ba8615b99c767"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "9ea20a186250a37199da9eb302aa4a08" -> "cbca088849b9ec69038207e5c03195f0"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "51a723cfd6753ef365118af65500a602" -> "b4bc89fe402fbe2737f43f2151460406"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "b163ea808d1c57db46c2dfc5cabf6423" -> "13d7f69d36b9a30e1a8e220a83a7c34c"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "2aad33af9667ac860effc2c87f5a2fce" -> "874153907b44f37aa9e1c1f6e4a59ed1"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "1063e1fca3ab791636db25c44c63a547" -> "1577d3d15d4e4d59f442f1064d8a0229"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "19cd4a2b50f8ff175ce0e32d29e9d099" -> "d771ca92aab372b45c1f5790876d55df"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "eca7d0e047544df245cd13930e65654f" -> "5a7fe54444a4d10db287ab5b63602e71"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "f3d9dc32b685bd00a64fa06f7e8275c2" -> "4f100a8de84ebe6f56931c281e75aaed"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "e64ab5e96ee7db3fa886b1df79a933d7" -> "eca411d8466dc5a02ded2a11a07acc0c"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "4101f8d9de61b39a50a6941eac6c01fa" -> "04cbc2b29849160dd8d1ab1d16debb2c"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "TYWCGuVvrc9sqeVdOChAusj+QxvtjYmPUFevTe1r+Z0=" -> "m77k1Qv3RBxC694iSiw7i9G/Za4Jrb6oXGNSKXVIIJo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "mc9UOvXW1ZBVwrqJbEZzJW68TMxqT3IxAQWjuocCQvk=" -> "JqH6I+hOIs6BSBRovEiKj/wJ0PTiaoEHxByQnydrniI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "CszAxaBqgscVqFK/MU0X/0WiMzCvwY7SYnooYo8/cVc=" -> "HHElK/K+eGqfkZjQk/e0FJmW5ialAYAQo9JeUodKyX8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "D+G6qptMpjfOUN1e9HgFIQHmjjtQtPNl0L2nwBBgfu8=" -> "A6ljZrLiAMtH6TquLvK8hUtnHE1MspklrRlII9txESY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "XBVgUq/niQR6pfIabAfA6CZV553aZ5wjUtlBuIpjWQ8=" -> "30cqNFCRKt/FdJHSY+dSwo8dSCfMiSd99s/D+aJIMyw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "L+cILwiEQXoq/5yaDS0rHP3V3yIhAinSuQwRtQbcepE=" -> "gAdFbDUMnDs69YTumHls4RpJeTwR53sOgNrsP52bbWc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "EWcOBLjFKoYylkKcfdbjoIOZsFW4zQseoCK17eIwaS8=" -> "n7I7j1u6VUsPEDbv25QEn4nTRUnDjosjCIShwakCrBw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "HINmKrNiME0UOU3QL1ATsJRR0tryDtD9x5mYa9imzyo=" -> "d3qF8xCjZmXXeL4oYDTkRUptk5Xs8dMhT3GxUMoVHLs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "9UTwXjsv1o8c8qaRfs8wcnbK+rLy3k6HvJREANU4ZHM=" -> "/Cr73AWcFGpLMfN1Fw2jIgw4KHnCb0AxPq1i/95S6Ks="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "KwTdB7tMJxc4ZTXITX6s58fAdbmImMKFL5wVHwjwSyE=" -> "Q6db2yi8R1Xx4NMaB448A1BWVOmIPRSueUGa1ViK9A8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "4H0OIV43+tstOK3KaiDU7mBn8lScyQy7qs5ogDHgd/w=" -> "UdliTr7Xq+Q8j+mrFi+ql79Nd/ftpnVbbv/0ES8ClSY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "or8bQsNcJycksUPl9sDL+DOFMUDaXaOXjAGtpe03Xrk=" -> "FcH2b+KtpD1PfkKHHJupcOiINjylHLn0pW4v95LcMi4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "s9gs3SCif51Eqh0ql/3yEfUjDUaUHAjirtaQf2mHdV4=" -> "Un7+LurlaiszNjb0RQWUFNa9F+ukCgD7+927d3R15CY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vpG8boMfnKj3hpS5myj9H7+qrr5oIGMhZYsWOon4PQ4=" -> "E616ZxjiuDtuyCjw3cTF2rf5/ztv3UbotNp09snxnF8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dNZVbdMhx5hIg9F1QB2yItHVJBgeMDbaK0rs0EV46pY=" -> "QLSVlqcROJlDGUUzJVi0dvyI7EvPZcyiRtiARWFEuoI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "M41+EbPf+llD/JCR6XfWoxnBWhrHuJQKEEOkKc2FtmE=" -> "JRvx/8D/t9vPnrRStkjLcQ8+ALtKaID2gLpN9pJ8LIo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "Y084Cvs1zvpCVnLrjSQZw2/jWaJsHi9t8+UIvn+CSZ4=" -> "fnxwCX6L0fWUYxNbE5F9oE8PWSJfcVFvFB5Bfq9uDzQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bz+PijrGOcUy7Zk2aH9+XUXOLT4e+byeiBMPr3YluOM=" -> "4Y7OWiqgPnCDK1UMeRHhixp3MF5KHQTiprkNwBv7xo0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "7GqROsvbBG4mUfeRsIzWWRd3hGpJvSV6PrsiQhMYQIY=" -> "ZR//zLRTMBj8AUu0jpdpHSwv1Fy1Sl1H6UyUMn4bP2E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-07T15:46:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "XTbZD3wgTTrjSJuHwoiHVlIR8T8L5gjoXCHLWmBviwE=" -> "b9aowUWQttxBYfuh2VuXF2sCElOJH6Vbmk0BklF6AB0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "AUejKNI2/ihuurNJLpE49SAdgspl/5HBOfUcR8g8Q3o=" -> "opTNM+j5ud/mMAEhtOPQZvvRHvhJ+gecx/wgCRyietA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "eWQC+eBHBpaz8F5/GcsAWgyW5dwJx67FhC7sEcJDGpA=" -> "85/MpkKACzjYHTDo5RqJlQseReDtVhasjqOzlMQWyVE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "2DZH6P4M8RDrWw4kylp8hPfQa9vsjoMlPgJoGBYdsq0=" -> "p5BmDch0uAvgDUApgwqWVHTgPedOY1lCGC9ZOoBC0Sw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "ewejkk0K+uWbtHCxMcaVJh0GerjXvuR2jaU+8NBsHBI=" -> "6nfGgiWaVHvNTVROUqs47LAOyd3s1EWsyfOqS+f5ooY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "yS/mjcGm68bYBSMCAX02dEJ08HC8H29mP7VjiyDJhVk=" -> "AxseNbjNm4+T4dtz/N2Nb07uM72J+TaiT+rRxE0tIH0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-07T14:44:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "e0WtX04/HPlS36ARsjFVgxOhKu8EeBRlDQKYuw/BcTg=" -> "cp4BcznSwaTFOnjTD8WjcTjq53o7O95M0NIghlBQ7W0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "MSvkpsJGnH81xgzfEJxj9tqtwr9UagwenB2qrKyIx0Y=" -> "kXyAiLAOGOovrPFPaypa4r4iMUeWHvD9hEfT7/ffDPU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-07T15:49:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "s5gsBSYKcJK8svMA56dd6JZGXbYKTGYFI/ZhXLRY7ho=" -> "LKk0xLpFMvZBc+xWRmM1tZ7Gduq9b6VD8VT+Art2mIQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "+hr8DxnHrFcMEihRXNHLrjshMdwAlJBe2fVbc+sgD7U=" -> "k1Z/Ivv5Dg+rcQOJvmtAabAuDnr/GOhvJ2d112scPYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "6lK8m224JHD8AGzeWxIdxOb0UyYoK7ThFUz45d0yPWs=" -> "8EE/JT86MBjomLNchePifLsnopL8ikHcrpWnPpQjEAM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "X8zdqdpRUFYe2DO4DDuvWRHCjtu0RAPmKiS/Bls89NA=" -> "RgS9eqE8COmmSbaKDO9IU2hTiceRbJnDzqH+1otR7WY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "jjMZb1tMUaa+Zp9iDqa5QbhnNVR+/0kPXVtvtKuMtUM=" -> "AQsFplz6qoZFN+Bn1CQHksI5H0lSj4yQFAtL2BZ7jdk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "JGDfxPGdprvspnOj0ZiTszGVGAGam8c6i1Bt7c5QLPE=" -> "pGFvjbhFcX4q5fQ2OfQ6NBsR63PiLlA+6J0xn/GeGRU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "FRzvrRAtklzGaf4Fa6QgxoP2TFLKGdwFn4FvGnHdMfs=" -> "yiY2S5SBNEr4wBXtigpp1bUlH14SVG3Fj/EjgSXthVU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "BJsKb9DYy8pQhVQ6N9Jhxz0dVX8t1H76H68/ynX3iwA=" -> "DTy4uHihalvGwIv4nWwQl55czhs6m7sQ2o3G/PCzmL4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "N3jLlKml6pQKreHUTX0kUvOcHM92/5cHg+piwUWRm2g=" -> "/dSoTsGAXxkaNXLnfEDEJ19eJggewXIPwJXhM621esQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "1A1KL29Y5Qzewl4V84ogs+EB9NvsE8LNi7ruDKukMj4=" -> "nNUCJoaHptSfnWe458p88Ek63Cx6stCRuTL2skAlgWY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "LdUdrQFvnTR2cuP++BN9bHwdOPcwaGdVBhV8pjdPyVI=" -> "KBiq+FvO9lI/BVdJ1Dijd8zzECi7pnteekAx/uqGgeU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr56d2uiEuo53jo3z6Lgh8AhikL6O+QtmUU/CfbaJq0=" -> "5HMHRzuZQCN8FnGEFxhNx8IB32fliUBhdKAE9uecUuI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "TPzqoMXa0sZ+u3gDXbgyY1z5rRh4GSZP8BVxgIdVDM8=" -> "vf96Vhbwthyb88++Ma3FEXUkSplLlj2LMyUwK40nZU0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-07T14:11:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "u7TFVOp95/vzpVOjVejVeNjzwgTlwDCQ8sm+bUOeKkE=" -> "XB2z8rMmQamUhU0YIfEekdKaMIqBwiLP7pq9D1cdaO4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-07T14:10:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "63ibKCKtJJMQRXc/UMO4OPG9SRV+/7WMlYuzQg/nrZE=" -> "3aO/Y473GtBaByfSu7+IW1nf0Az1odMcCh4X4b2TXfI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-07T14:10:35Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "z3eha4" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-07T14:10:34Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-07T14:10:33Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 87 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*